// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "代理伺服器設定";
HSDTaskDescription = "印表機支援連線至 Internet。如果您使用代理伺服器連線至 Internet，請設定下方的設定。";
TaskDescriptionInAssistantMode = "若要連線到 HP Web 服務，您的印表機需要連線到網際網路。如果使用 Proxy 伺服器來連線到網際網路，請在下方輸入設定。\n\n如果不知道您的 代理設定，請參閱「網路偏好設定」窗格中的設定，或聯絡系統管理員。";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "无需代理服务器连接Internet";
HSDAutomaticProxySettingsTitle = "自動（裝置將自動偵測設定）";
HSDCustomProxySettingsTitle = "自訂 代理伺服器組態設定：";
HSDSystemProxySettingsTitle = "複製系統設定";

// Proxy server settings
HSDProxyServerTitle = "代理伺服器:";
ProxyPortTitle = "Proxy 連接埠:";

// Authentication
HSDRequiresAuthenticationButton = "代理伺服器需要認證";
HSDUserNameTitle = "使用者名稱:";
HSDPasswordTitle = "密碼:";

HSDApplyNowButtonTitle = "立即套用";

// progress titles
UpdateInformationProcessTitle = "正在更新資訊...";

// alerts
EmptyProxyServerOrPortErrorText = "必須同時指定代理伺服器和代理伺服器埠。";

EmptyUserNameOrPasswordErrorText = "代理伺服器認證需要同時指定使用者名稱和密碼。";

IncorrectProxyServerNameFormatErrorText = "無法設定代理伺服器名稱。請檢查格式是否有效。";

HSDUserNameTooLargeErrorText = "使用者名稱太長。您的裝置支援最高 %d 個字元之使用者名稱。";
